MPS/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКартинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>URLКартинки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>URLПродукта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодностиВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Создан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Обновлен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаРеальная</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

MPS/src/Catalogs/Номенклатура/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// Возвращаемое значение:
//   см. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииЗаблокированныхРеквизитов.ЗаблокированныеРеквизиты
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	БлокируемыеРеквизиты = Новый Массив;

	Реквизит = ЗапретРедактированияРеквизитовОбъектов.НовыйБлокируемыйРеквизит();
	Реквизит.Группа = "";
	Реквизит.ПредставлениеГруппы = НСтр("ru = 'Заблокированные реквизиты'");
	Реквизит.Предупреждение = НСтр("ru = 'Не рекомендуется изменять, если номенклатура уже используются'");
	БлокируемыеРеквизиты.Добавить(Реквизит);

	БлокируемыеРеквизиты.Добавить("Наименование");
	БлокируемыеРеквизиты.Добавить("ГруппаДоступа");
	БлокируемыеРеквизиты.Добавить("Штрихкод");
	БлокируемыеРеквизиты.Добавить("Артикул");
	БлокируемыеРеквизиты.Добавить("Производитель");
	БлокируемыеРеквизиты.Добавить("ТоварнаяКатегория");
	БлокируемыеРеквизиты.Добавить("URLКартинки");
	БлокируемыеРеквизиты.Добавить("URLПродукта");
	БлокируемыеРеквизиты.Добавить("СрокГодностиВДнях");
	БлокируемыеРеквизиты.Добавить("Цена");
	БлокируемыеРеквизиты.Добавить("ЦенаРеальная");
	БлокируемыеРеквизиты.Добавить("Себестоимость");
	БлокируемыеРеквизиты.Добавить("Родитель");

	Возврат БлокируемыеРеквизиты;

КонецФункции

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов


// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ИСТИНА
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ЭтоГруппа
	|	ИЛИ ЗначениеРазрешено(Ссылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти
#Область ОбработчикиСобытий

#КонецОбласти

#КонецЕсли
